CBMJasonZhu/iNMECH_IM31_LIGHTS/LIN/arch/stm8/lin_def_stm8_gen.h
  #elif (LIN_ZERO_PAGE_SIZE  >=  17 * LIN_IFC_NR_MAX)
  
  #ifdef __COSMIC__
	#define LIN_ZERO_PAGE1 @tiny
    #define LIN_ZERO_PAGE2 @tiny
    #define LIN_ZERO_PAGE3 @tiny
    #define LIN_ZERO_PAGE4 @tiny
    #define LIN_ZERO_PAGE5 @tiny
    #define LIN_ZERO_PAGE8 @tiny
    #define LIN_ZERO_PAGE10 @tiny
	#elif __RAISONANCE__
	#define LIN_ZERO_PAGE1 page0
    #define LIN_ZERO_PAGE2 page0
    #define LIN_ZERO_PAGE3 page0
    #define LIN_ZERO_PAGE4 page0
    #define LIN_ZERO_PAGE5 page0
    #define LIN_ZERO_PAGE8 page0
    #define LIN_ZERO_PAGE10 page0
	#elif __IAR__
	#define LIN_ZERO_PAGE1 __tiny
    #define LIN_ZERO_PAGE2 __tiny
    #define LIN_ZERO_PAGE3 __tiny
    #define LIN_ZERO_PAGE4 __tiny
    #define LIN_ZERO_PAGE5 __tiny
    #define LIN_ZERO_PAGE8 __tiny
    #define LIN_ZERO_PAGE10 __tiny
	#endif
	
    
  #elif (LIN_ZERO_PAGE_SIZE  >=  16 * LIN_IFC_NR_MAX)
  
  #ifdef __COSMIC__
	#define LIN_ZERO_PAGE1 @tiny
    #define LIN_ZERO_PAGE2 @tiny
    #define LIN_ZERO_PAGE3 @tiny
    #define LIN_ZERO_PAGE4 @tiny
    #define LIN_ZERO_PAGE8 @tiny
    #define LIN_ZERO_PAGE10 @tiny
	#elif __RAISONANCE__
	#define LIN_ZERO_PAGE1 page0
    #define LIN_ZERO_PAGE2 page0
    #define LIN_ZERO_PAGE3 page0
    #define LIN_ZERO_PAGE4 page0
    #define LIN_ZERO_PAGE8 page0
    #define LIN_ZERO_PAGE10 page0
	#elif __IAR__
	#define LIN_ZERO_PAGE1 __tiny
    #define LIN_ZERO_PAGE2 __tiny
    #define LIN_ZERO_PAGE3 __tiny
    #define LIN_ZERO_PAGE4 __tiny
    #define LIN_ZERO_PAGE8 __tiny
    #define LIN_ZERO_PAGE10 __tiny
	#endif
	
    
  #elif (LIN_ZERO_PAGE_SIZE  >=  15 * LIN_IFC_NR_MAX)
  
  #ifdef __COSMIC__
	#define LIN_ZERO_PAGE1 @tiny
    #define LIN_ZERO_PAGE2 @tiny
    #define LIN_ZERO_PAGE3 @tiny
    #define LIN_ZERO_PAGE4 @tiny
    #define LIN_ZERO_PAGE10 @tiny
	#elif __RAISONANCE__
	#define LIN_ZERO_PAGE1 page0
    #define LIN_ZERO_PAGE2 page0
    #define LIN_ZERO_PAGE3 page0
    #define LIN_ZERO_PAGE4 page0
    #define LIN_ZERO_PAGE10 page0
	#elif __IAR__
	#define LIN_ZERO_PAGE1 __tiny
    #define LIN_ZERO_PAGE2 __tiny
    #define LIN_ZERO_PAGE3 __tiny
    #define LIN_ZERO_PAGE4 __tiny
    #define LIN_ZERO_PAGE10 __tiny
	#endif
	
    
  #elif (LIN_ZERO_PAGE_SIZE  >=  14 * LIN_IFC_NR_MAX)
  
  #ifdef __COSMIC__
	#define LIN_ZERO_PAGE1 @tiny
    #define LIN_ZERO_PAGE4 @tiny
    #define LIN_ZERO_PAGE3 @tiny
    #define LIN_ZERO_PAGE10 @tiny
	#elif __RAISONANCE__
	#define LIN_ZERO_PAGE1 page0
    #define LIN_ZERO_PAGE4 page0
    #define LIN_ZERO_PAGE3 page0
    #define LIN_ZERO_PAGE10 page0
	#elif __IAR__
	#define LIN_ZERO_PAGE1 __tiny
    #define LIN_ZERO_PAGE4 __tiny
    #define LIN_ZERO_PAGE3 __tiny
    #define LIN_ZERO_PAGE10 __tiny
	#endif
	
    
  #elif (LIN_ZERO_PAGE_SIZE  >=  13 * LIN_IFC_NR_MAX)
  
  #ifdef __COSMIC__
	#define LIN_ZERO_PAGE1 @tiny
    #define LIN_ZERO_PAGE2 @tiny
    #define LIN_ZERO_PAGE3 @tiny
    #define LIN_ZERO_PAGE4 @tiny
    #define LIN_ZERO_PAGE5 @tiny
    #define LIN_ZERO_PAGE6 @tiny
    #define LIN_ZERO_PAGE7 @tiny
    #define LIN_ZERO_PAGE8 @tiny
    #define LIN_ZERO_PAGE9 @tiny
	#elif __RAISONANCE__
	#define LIN_ZERO_PAGE1 page0
    #define LIN_ZERO_PAGE2 page0
    #define LIN_ZERO_PAGE3 page0
    #define LIN_ZERO_PAGE4 page0
    #define LIN_ZERO_PAGE5 page0
    #define LIN_ZERO_PAGE6 page0
    #define LIN_ZERO_PAGE7 page0
    #define LIN_ZERO_PAGE8 page0
    #define LIN_ZERO_PAGE9 page0
	#elif __IAR__
	#define LIN_ZERO_PAGE1 __tiny
    #define LIN_ZERO_PAGE2 __tiny
    #define LIN_ZERO_PAGE3 __tiny
    #define LIN_ZERO_PAGE4 __tiny
    #define LIN_ZERO_PAGE5 __tiny
    #define LIN_ZERO_PAGE6 __tiny
    #define LIN_ZERO_PAGE7 __tiny
    #define LIN_ZERO_PAGE8 __tiny
    #define LIN_ZERO_PAGE9 __tiny
	#endif
	
    
  #elif (LIN_ZERO_PAGE_SIZE  >=  12 * LIN_IFC_NR_MAX)
  
  #ifdef __COSMIC__
	#define LIN_ZERO_PAGE1 @tiny
    #define LIN_ZERO_PAGE2 @tiny
    #define LIN_ZERO_PAGE3 @tiny
    #define LIN_ZERO_PAGE4 @tiny
    #define LIN_ZERO_PAGE5 @tiny
    #define LIN_ZERO_PAGE6 @tiny
    #define LIN_ZERO_PAGE7 @tiny
    #define LIN_ZERO_PAGE9 @tiny
	#elif __RAISONANCE__
	#define LIN_ZERO_PAGE1 page0
    #define LIN_ZERO_PAGE2 page0
    #define LIN_ZERO_PAGE3 page0
    #define LIN_ZERO_PAGE4 page0
    #define LIN_ZERO_PAGE5 page0
    #define LIN_ZERO_PAGE6 page0
    #define LIN_ZERO_PAGE7 page0
    #define LIN_ZERO_PAGE9 page0
	#elif __IAR__
	#define LIN_ZERO_PAGE1 __tiny
    #define LIN_ZERO_PAGE2 __tiny
    #define LIN_ZERO_PAGE3 __tiny
    #define LIN_ZERO_PAGE4 __tiny
    #define LIN_ZERO_PAGE5 __tiny
    #define LIN_ZERO_PAGE6 __tiny
    #define LIN_ZERO_PAGE7 __tiny
    #define LIN_ZERO_PAGE9 __tiny
	#endif
	
    
  #elif (LIN_ZERO_PAGE_SIZE  >=  11 * LIN_IFC_NR_MAX)
  
  #ifdef __COSMIC__
	#define LIN_ZERO_PAGE1 @tiny
    #define LIN_ZERO_PAGE2 @tiny
    #define LIN_ZERO_PAGE3 @tiny
    #define LIN_ZERO_PAGE4 @tiny
    #define LIN_ZERO_PAGE5 @tiny
    #define LIN_ZERO_PAGE6 @tiny
    #define LIN_ZERO_PAGE7 @tiny
    #define LIN_ZERO_PAGE8 @tiny
	#elif __RAISONANCE__
	#define LIN_ZERO_PAGE1 page0
    #define LIN_ZERO_PAGE2 page0
    #define LIN_ZERO_PAGE3 page0
    #define LIN_ZERO_PAGE4 page0
    #define LIN_ZERO_PAGE5 page0
    #define LIN_ZERO_PAGE6 page0
    #define LIN_ZERO_PAGE7 page0
    #define LIN_ZERO_PAGE8 page0
	#elif __IAR__
	#define LIN_ZERO_PAGE1 __tiny
    #define LIN_ZERO_PAGE2 __tiny
    #define LIN_ZERO_PAGE3 __tiny
    #define LIN_ZERO_PAGE4 __tiny
    #define LIN_ZERO_PAGE5 __tiny
    #define LIN_ZERO_PAGE6 __tiny
    #define LIN_ZERO_PAGE7 __tiny
    #define LIN_ZERO_PAGE8 __tiny
	#endif
	
    
  #elif (LIN_ZERO_PAGE_SIZE  >=  10 * LIN_IFC_NR_MAX)
  
  #ifdef __COSMIC__
	#define LIN_ZERO_PAGE1 @tiny
    #define LIN_ZERO_PAGE2 @tiny
    #define LIN_ZERO_PAGE3 @tiny
    #define LIN_ZERO_PAGE4 @tiny
    #define LIN_ZERO_PAGE5 @tiny
    #define LIN_ZERO_PAGE6 @tiny
    #define LIN_ZERO_PAGE7 @tiny
	#elif __RAISONANCE__
	#define LIN_ZERO_PAGE1 page0
    #define LIN_ZERO_PAGE2 page0
    #define LIN_ZERO_PAGE3 page0
    #define LIN_ZERO_PAGE4 page0
    #define LIN_ZERO_PAGE5 page0
    #define LIN_ZERO_PAGE6 page0
    #define LIN_ZERO_PAGE7 page0
	#elif __IAR__
	#define LIN_ZERO_PAGE1 __tiny
    #define LIN_ZERO_PAGE2 __tiny
    #define LIN_ZERO_PAGE3 __tiny
    #define LIN_ZERO_PAGE4 __tiny
    #define LIN_ZERO_PAGE5 __tiny
    #define LIN_ZERO_PAGE6 __tiny
    #define LIN_ZERO_PAGE7 __tiny
	#endif
	
    
